---
type: DefaultOpenFromCloudCallback
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# DefaultOpenFromCloudCallback

`Autodesk.Revit.DB.DefaultOpenFromCloudCallback` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DefaultOpenFromCloudCallback | 2019 | `public DefaultOpenFromCloudCallback ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | OnOpenConflict | 2019 | `public virtual OpenConflictResult OnOpenConflict ( OpenConflictScenario scenario )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |